app/controllers/books_controller.rb

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "favorites" ON "users"."id" = "favorites"."user_id" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" IN (?, ?)  [["book_id", 1], ["book_id", 2]]
---
  def index
    @books = Book.all
    @books= Book.includes(:favorited_users).sort {|a,b| b.favorited_users.size <=> a.favorited_users.size}

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "hanako"], ["body", "hanako1"], ["user_id", 1], ["created_at", "2021-10-13 11:18:12.752352"], ["updated_at", "2021-10-13 11:18:12.752352"]]
---
  def createfavorited_users
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save